app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 4]]
---
  def index
    @accounts = current_user.accounts.all

INSERT INTO "accounts" ("expense", "money", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["expense", "SDFS"], ["money", 1233.0], ["user_id", 4], ["created_at", "2015-05-15 04:24:08.136909"], ["updated_at", "2015-05-15 04:24:08.136909"]]
---
  def create
    @account = current_user.accounts.new(account_params)

    respond_to do |format|
      if @account.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_account
      @account = Account.find(params[:id])