app/controllers/home_controller.rb

    def index
		if user_signed_in?
		@accounts = current_user.accounts.last(5)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  ORDER BY "accounts"."id" DESC LIMIT 5  [["user_id", 5]]